---
kind: property
id: P:Autodesk.Revit.DB.RuledFace.RulingsAreParallel
source: html/4ea772f5-7913-987c-78cb-c8f15eeadfa8.htm
---
# Autodesk.Revit.DB.RuledFace.RulingsAreParallel Property

Determines if the rulings of this ruled surface are parallel.

## Syntax (C#)
```csharp
public bool RulingsAreParallel { get; }
```